---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SegmentsAngleTooGreatWarning
source: html/63915a37-5c94-724f-1b0e-7ef5f4f95213.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SegmentsAngleTooGreatWarning Property

The resulting angle between the segments is too great.

## Syntax (C#)
```csharp
public static FailureDefinitionId SegmentsAngleTooGreatWarning { get; }
```